db-assets/output/jmx/db-load-db2.jmx
<?xml version='1.0' encoding='UTF-8'?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Database Load Test (DB2)" enabled="true"><stringProp name="TestPlan.comments" /><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments" /></elementProp><stringProp name="TestPlan.user_define_classpath" /></TestPlan><hashTree><Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="THREAD_COUNT" elementType="Argument"><stringProp name="Argument.name">THREAD_COUNT</stringProp><stringProp name="Argument.value">${__P(threads,10)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="RAMP_UP_SEC" elementType="Argument"><stringProp name="Argument.name">RAMP_UP_SEC</stringProp><stringProp name="Argument.value">${__P(rampup,60)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DURATION_SEC" elementType="Argument"><stringProp name="Argument.name">DURATION_SEC</stringProp><stringProp name="Argument.value">${__P(duration,3600)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DB_HOST" elementType="Argument"><stringProp name="Argument.name">DB_HOST</stringProp><stringProp name="Argument.value">${__P(db_host,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DB_PORT" elementType="Argument"><stringProp name="Argument.name">DB_PORT</stringProp><stringProp name="Argument.value">${__P(db_port,50000)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DB_NAME" elementType="Argument"><stringProp name="Argument.name">DB_NAME</stringProp><stringProp name="Argument.value">${__P(db_name,testdb)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DB_USER" elementType="Argument"><stringProp name="Argument.name">DB_USER</stringProp><stringProp name="Argument.value">${__P(db_user,test_user)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DB_PASSWORD" elementType="Argument"><stringProp name="Argument.name">DB_PASSWORD</stringProp><stringProp name="Argument.value">${__P(db_password,Test@123)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DB_ADMIN_USER" elementType="Argument"><stringProp name="Argument.name">DB_ADMIN_USER</stringProp><stringProp name="Argument.value">${__P(db_admin_user,test_admin)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="DB_ADMIN_PASSWORD" elementType="Argument"><stringProp name="Argument.name">DB_ADMIN_PASSWORD</stringProp><stringProp name="Argument.value">${__P(db_admin_password,Admin@789)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></Arguments><hashTree /><JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection - Regular User" enabled="true"><stringProp name="dataSource">db_pool</stringProp><stringProp name="dbUrl">jdbc:db2://${DB_HOST}:${DB_PORT}/${DB_NAME}</stringProp><stringProp name="driver">com.ibm.db2.jcc.DB2Driver</stringProp><stringProp name="username">${DB_USER}</stringProp><stringProp name="password">${DB_PASSWORD}</stringProp><boolProp name="autocommit">true</boolProp><stringProp name="poolMax">10</stringProp><stringProp name="timeout">10000</stringProp><stringProp name="trimInterval">60000</stringProp><stringProp name="connectionAge">5000</stringProp><stringProp name="checkQuery" /><stringProp name="connectionProperties" /><stringProp name="initQuery" /><boolProp name="keepAlive">true</boolProp><stringProp name="transactionIsolation">DEFAULT</stringProp><boolProp name="preinit">false</boolProp></JDBCDataSource><hashTree /><JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection - Admin User" enabled="true"><stringProp name="dataSource">db_pool_admin</stringProp><stringProp name="dbUrl">jdbc:db2://${DB_HOST}:${DB_PORT}/${DB_NAME}</stringProp><stringProp name="driver">com.ibm.db2.jcc.DB2Driver</stringProp><stringProp name="username">${DB_ADMIN_USER}</stringProp><stringProp name="password">${DB_ADMIN_PASSWORD}</stringProp><boolProp name="autocommit">true</boolProp><stringProp name="poolMax">10</stringProp><stringProp name="timeout">10000</stringProp><stringProp name="trimInterval">60000</stringProp><stringProp name="connectionAge">5000</stringProp><stringProp name="checkQuery" /><stringProp name="connectionProperties" /><stringProp name="initQuery" /><boolProp name="keepAlive">true</boolProp><stringProp name="transactionIsolation">DEFAULT</stringProp><boolProp name="preinit">false</boolProp></JDBCDataSource><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Customer IDs" enabled="true"><stringProp name="filename">params/customer_ids.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">customer_id</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Order Params" enabled="true"><stringProp name="filename">params/order_params.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">order_id,status,amount</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Product IDs" enabled="true"><stringProp name="filename">params/product_ids.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">product_id</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Date Ranges" enabled="true"><stringProp name="filename">params/date_ranges.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">start_date,end_date</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Sensitive Patient IDs" enabled="true"><stringProp name="filename">params/sensitive_patient_ids.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">patient_id</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Sensitive Account IDs" enabled="true"><stringProp name="filename">params/sensitive_account_ids.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">account_id</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="DDL Params" enabled="true"><stringProp name="filename">params/ddl_params.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">table_name,column_name,column_type</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Grant Params" enabled="true"><stringProp name="filename">params/grant_params.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">grant_table,grant_user</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="New Users" enabled="true"><stringProp name="filename">params/new_users.csv</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="variableNames">new_username,new_password</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">shareMode.all</stringProp><boolProp name="ignoreFirstLine">true</boolProp></CSVDataSet><hashTree /><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Database Load Threads" enabled="true"><stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp><stringProp name="ThreadGroup.num_threads">${THREAD_COUNT}</stringProp><stringProp name="ThreadGroup.ramp_time">${RAMP_UP_SEC}</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${DURATION_SEC}</stringProp><stringProp name="ThreadGroup.delay" /><boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp></ThreadGroup><hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="SELECT Simple (30%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">30.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Select Customer by ID" enabled="true"><stringProp name="dataSource">db_pool</stringProp><stringProp name="query">SELECT customer_id, email, first_name, last_name, phone, created_at FROM customers WHERE customer_id = ?</stringProp><stringProp name="queryType">Prepared Select Statement</stringProp><stringProp name="queryArguments">${customer_id}</stringProp><stringProp name="queryArgumentsTypes">INTEGER</stringProp><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="SELECT Complex (15%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">15.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Select Orders with Customer" enabled="true"><stringProp name="dataSource">db_pool</stringProp><stringProp name="query">SELECT o.order_id, o.order_date, o.status, o.total_amount,
       c.first_name, c.last_name, c.email
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id
WHERE o.status = ? AND o.total_amount &gt; ?</stringProp><stringProp name="queryType">Prepared Select Statement</stringProp><stringProp name="queryArguments">${status},${amount}</stringProp><stringProp name="queryArgumentsTypes">VARCHAR,DECIMAL</stringProp><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="INSERT (15%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">15.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Insert Order" enabled="true"><stringProp name="dataSource">db_pool</stringProp><stringProp name="query">INSERT INTO orders (customer_id, status, total_amount) VALUES (?, 'PENDING', ?)</stringProp><stringProp name="queryType">Prepared Update Statement</stringProp><stringProp name="queryArguments">${customer_id},${amount}</stringProp><stringProp name="queryArgumentsTypes">INTEGER,DECIMAL</stringProp><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="UPDATE (15%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">15.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Update Order Status" enabled="true"><stringProp name="dataSource">db_pool</stringProp><stringProp name="query">UPDATE orders SET status = ? WHERE order_id = ?</stringProp><stringProp name="queryType">Prepared Update Statement</stringProp><stringProp name="queryArguments">${status},${order_id}</stringProp><stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="DELETE (10%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">10.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Delete Cart Items" enabled="true"><stringProp name="dataSource">db_pool</stringProp><stringProp name="query">DELETE FROM cart_items WHERE customer_id = ?</stringProp><stringProp name="queryType">Prepared Update Statement</stringProp><stringProp name="queryArguments">${customer_id}</stringProp><stringProp name="queryArgumentsTypes">INTEGER</stringProp><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Sensitive Queries (5%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">5.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Select Patient with SSN" enabled="true"><stringProp name="dataSource">db_pool</stringProp><stringProp name="query">SELECT p.patient_id, p.first_name, p.last_name, p.ssn, p.date_of_birth,
       m.diagnosis, m.treatment
FROM patients p
LEFT JOIN medical_records m ON p.patient_id = m.patient_id
WHERE p.patient_id = ?</stringProp><stringProp name="queryType">Prepared Select Statement</stringProp><stringProp name="queryArguments">${patient_id}</stringProp><stringProp name="queryArgumentsTypes">INTEGER</stringProp><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="DDL (3%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">3.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="ALTER TABLE - Add Column" enabled="true"><stringProp name="dataSource">db_pool_admin</stringProp><stringProp name="query">BEGIN
    DECLARE column_exists INTEGER;
    SELECT COUNT(*) INTO column_exists FROM syscat.columns
    WHERE tabname = UPPER('${table_name}') AND colname = UPPER('${column_name}');
    IF column_exists = 0 THEN
        EXECUTE IMMEDIATE 'ALTER TABLE ${table_name} ADD COLUMN ${column_name} ${column_type}';
    END IF;
END</stringProp><stringProp name="queryType">Update Statement</stringProp><stringProp name="queryArguments" /><stringProp name="queryArgumentsTypes" /><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="GRANT/REVOKE (3%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">3.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Grant SELECT" enabled="true"><stringProp name="dataSource">db_pool_admin</stringProp><stringProp name="query">GRANT SELECT ON ${grant_table} TO ${grant_user}</stringProp><stringProp name="queryType">Update Statement</stringProp><stringProp name="queryArguments" /><stringProp name="queryArgumentsTypes" /><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="CREATE USER (2%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">2.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Create User" enabled="true"><stringProp name="dataSource">db_pool_admin</stringProp><stringProp name="query">CREATE USER ${new_username} USING '${new_password}';
GRANT CONNECT ON DATABASE TO USER ${new_username};</stringProp><stringProp name="queryType">Update Statement</stringProp><stringProp name="queryArguments" /><stringProp name="queryArgumentsTypes" /><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree><ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Auth/Session (2%)" enabled="true"><intProp name="ThroughputController.style">1</intProp><boolProp name="ThroughputController.perThread">true</boolProp><intProp name="ThroughputController.maxThroughput">1</intProp><floatProp name="ThroughputController.percentThroughput">2.0</floatProp></ThroughputController><hashTree><JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Set Session Role" enabled="true"><stringProp name="dataSource">db_pool_admin</stringProp><stringProp name="query">SET SESSION AUTHORIZATION ${grant_user}</stringProp><stringProp name="queryType">Update Statement</stringProp><stringProp name="queryArguments" /><stringProp name="queryArgumentsTypes" /><stringProp name="variableNames" /><stringProp name="resultVariable" /><stringProp name="queryTimeout" /><stringProp name="resultSetMaxRows" /><stringProp name="resultSetHandler">Store as String</stringProp></JDBCSampler><hashTree /></hashTree></hashTree><ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><stringProp name="name">saveConfig</stringProp><value class="SampleSaveConfiguration"><boolProp name="time">true</boolProp><boolProp name="latency">true</boolProp><boolProp name="timestamp">true</boolProp><boolProp name="success">true</boolProp><boolProp name="label">true</boolProp><boolProp name="code">true</boolProp><boolProp name="message">true</boolProp><boolProp name="threadName">true</boolProp><boolProp name="dataType">true</boolProp><boolProp name="encoding">false</boolProp><boolProp name="assertions">true</boolProp><boolProp name="subresults">true</boolProp><boolProp name="responseData">false</boolProp><boolProp name="samplerData">false</boolProp><boolProp name="xml">false</boolProp><boolProp name="fieldNames">true</boolProp><boolProp name="responseHeaders">false</boolProp><boolProp name="requestHeaders">false</boolProp><boolProp name="responseDataOnError">false</boolProp><boolProp name="saveAssertionResultsFailureMessage">true</boolProp><boolProp name="bytes">true</boolProp><boolProp name="sentBytes">true</boolProp><boolProp name="url">true</boolProp><boolProp name="threadCounts">true</boolProp><boolProp name="idleTime">true</boolProp><boolProp name="connectTime">true</boolProp></value></objProp><stringProp name="filename" /></ResultCollector><hashTree /><ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><stringProp name="name">saveConfig</stringProp><value class="SampleSaveConfiguration"><boolProp name="time">true</boolProp><boolProp name="latency">true</boolProp><boolProp name="timestamp">true</boolProp><boolProp name="success">true</boolProp><boolProp name="label">true</boolProp><boolProp name="code">true</boolProp><boolProp name="message">true</boolProp><boolProp name="threadName">true</boolProp><boolProp name="dataType">true</boolProp><boolProp name="encoding">false</boolProp><boolProp name="assertions">true</boolProp><boolProp name="subresults">true</boolProp><boolProp name="responseData">false</boolProp><boolProp name="samplerData">false</boolProp><boolProp name="xml">false</boolProp><boolProp name="fieldNames">true</boolProp><boolProp name="responseHeaders">false</boolProp><boolProp name="requestHeaders">false</boolProp><boolProp name="responseDataOnError">false</boolProp><boolProp name="saveAssertionResultsFailureMessage">true</boolProp><boolProp name="bytes">true</boolProp><boolProp name="sentBytes">true</boolProp><boolProp name="url">true</boolProp><boolProp name="threadCounts">true</boolProp><boolProp name="idleTime">true</boolProp><boolProp name="connectTime">true</boolProp></value></objProp><stringProp name="filename" /></ResultCollector><hashTree /><ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true"><boolProp name="ResultCollector.error_logging">false</boolProp><objProp><stringProp name="name">saveConfig</stringProp><value class="SampleSaveConfiguration"><boolProp name="time">true</boolProp><boolProp name="latency">true</boolProp><boolProp name="timestamp">true</boolProp><boolProp name="success">true</boolProp><boolProp name="label">true</boolProp><boolProp name="code">true</boolProp><boolProp name="message">true</boolProp><boolProp name="threadName">true</boolProp><boolProp name="dataType">true</boolProp><boolProp name="encoding">false</boolProp><boolProp name="assertions">true</boolProp><boolProp name="subresults">true</boolProp><boolProp name="responseData">false</boolProp><boolProp name="samplerData">false</boolProp><boolProp name="xml">false</boolProp><boolProp name="fieldNames">true</boolProp><boolProp name="responseHeaders">false</boolProp><boolProp name="requestHeaders">false</boolProp><boolProp name="responseDataOnError">false</boolProp><boolProp name="saveAssertionResultsFailureMessage">true</boolProp><boolProp name="bytes">true</boolProp><boolProp name="sentBytes">true</boolProp><boolProp name="url">true</boolProp><boolProp name="threadCounts">true</boolProp><boolProp name="idleTime">true</boolProp><boolProp name="connectTime">true</boolProp></value></objProp><stringProp name="filename" /></ResultCollector><hashTree /></hashTree></jmeterTestPlan>